#!/usr/bin/env python3
# -*- coding: utf-8 -*-

"""正则表达式 Regular Expression

基本结构：
/ (元字符) 原子 / 模式修正符
- 斜杠 / 为定界符
- 原子：实际要匹配的内容，一般为数字、字母等普通字符
- 元字符：用来修饰原子，不能单独出现，具有特殊含义，可使用反斜杠\进行转义
- 模式修正符：调整、扩展正则解释

常用操作符：
. 表示任意单个字符
[ ] 字符集，对单个字符给出取值范围，如[abc]表示a或b或c, [a-z]表示a到z单个字符
[^ ] 非字符集，对单个字符给出排除范围，如[^abc]表示非a或b或c的单个字符
* 前一个字符0次或无限次扩展，如abc*, 表示ab, abc, abcc, abccc等
+ 前一个字符1次或无限次扩展，如abc+, 表示abc, abccc, abccc等
? 前一个字符0次或1次扩展，如abc?, 表示ab, abc
{m} 扩展前一个字符m次，如ab{2}c表示abbc
{m,n} 扩展前一个字符m至n次(含n)，如ab{1,2}c表示abc, abbc
^ 匹配字符串开头，如^abc表示以abc开头的字符串
$ 匹配字符串结尾，如abc$表示以abc结尾的字符串
| 左右表达式任意一个，如abc|xyz, 表示abc或xyz
() 分组标记，内部只能用|操作符，如(abc)表示abc, (abc|xyz)表示abc、xyz
\d 数字，等价于[0-9]
\w 单词字符，等价于[A-Za-z0-9]

经典正则表达式实例
^[A-Za-z]+$ 由26个英文字母组成的字符串
^[A-Za-z0-9]+$ 由26个英文字母和数字组成的字符串
^-?\d+$ 整数（包括负数）形式的字符串
[1-9]\d{5} 邮政编码6位
[\u4e00-\u9fa5] 中文字符
\d{3}-\d{8}|\d{4}-\d{7} 国内座机号码
(137|138|152|158|159)\d{8} 国内手机号码
(([1-9]?\d|1\d{2}|2[0-4]\d|25[0-5]).){3}([1-9]?\d|1\d{2}|2[0-4]\d|25[0-5]) IPv4地址，分4段，每段0-255
"""

# 常使用raw string类型表示正则表达式，不需要对转义符再次进行转义
re_str = r'[1-9]\d{5}'

# 使用普通字符串类型需要对转义符进行再次转义
re_str = '[1-9]\\d{5}'
